// // 1
// // Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
//
// let arr = ['a', 'b', 'c'];
// let l = arr.length;
//
// for (let i = 1; i <= l; i++) {
//   arr[arr.length] = i
// }
//
// console.log(arr);

// // 2
// // Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
//
// let arr = [1,2,3];
// let newArr = [];
//
// for (let i = arr.length - 1; i >= 0; i--) {
//     newArr.push(arr[i]);
// }
//
// console.log(newArr);

// // 3
// // Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
//
// let arr = [1,2,3];
//
// while (arr.length < 6) {
//     arr[arr.length] = ++arr.length;
// }
//
// console.log(arr);

// // 4
// // Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
//
// let arr = [1,2,3];
// let nums = [4,5,6];
//
// for (const num of nums) {
//     arr.unshift(num);
// }
//
// console.log(arr);

// // 5
// // Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift().
//
// let arr = ['js','css','jq'];
//
// console.log(arr.shift());

// // 6
// // Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop().
//
// let arr = ['js','css','jq'];
//
// console.log(arr.pop());

// // 7
// // Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
//
// let arr = [1,2,3,4,5];
//
// arr = arr.slice(3,5);
// console.log(arr);

// // 8
// // Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
//
// let arr = [1,2,3,4,5];
//
// arr = arr.slice(0,2);
// console.log(arr);

// // 9
// // Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
//
// let arr = [1,2,3,4,5];
//
// arr.splice(1,2);
// console.log(arr);

// // 10
// // Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//
// let arr = [1,2,3,4,5];
//
// arr.splice(3,0,'a','b','c');
// console.log(arr);

// // 11
// // Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з
// // нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//
// let arr = [1,2,3,4,5];
//
// arr.splice(1,0, 'a', 'b');
// arr.splice(6,0, 'c')
// arr.splice(8,0, 'e')
//
// console.log(arr);

// // 12
// // Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
//
// let nums = [1,2,3,4,5,6,7,8,9,10];
//
// for (const num of nums) {
//     if (num % 2 === 0) {
//         console.log(num);
//     }
// }

// // 13
// // Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// // За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший.
//
// let nums = [1,2,3,4,5,6,7,8,9,10];
// let nums2 = [];
//
// for (const num of nums) {
//     nums2.push(num);
// }
//
// console.log(nums2);

// // 14
// // Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// // За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
// let nums = [1,2,3,4,5,6,7,8,9,10];
// let nums2 = [];
//
// for (let i = 0; i < nums.length; i++) {
//     nums2[i] = nums[i];
// }
//
// console.log(nums2);

//====================================================================================================================

// // 1
// // Зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//
// let arr = [2,17,13,6,22,31,45,66,100,-18];

// // 1.1
// // Перебрати його циклом while.
//
// let i = 0;
//
// while (i < arr.length) {
//     console.log(arr[i]);
//     i++;
// }

// // 1.2
// // Перебрати його циклом for.
//
// for (const num of arr) {
//     console.log(num);
// }

// // 1.3
// // Перебрати циклом while та вивести  числа тільки з непарним індексом.
//
// let i = 0;
//
// while (i < arr.length) {
//     if (i % 2 > 0) {
//     console.log(arr[i]);
//     }
//     i++;
// }

// // 1.4
// // Перебрати циклом for та вивести  числа тільки з непарним індексом.
//
// let len = arr.length;
//
// for (let i = 0; i < len; i++) {
//     if (i % 2 > 0 )
//     console.log(arr[i]);
// }

// // 1.5
// // Перебрати циклом while та вивести  числа тільки парні  значення.
//
// let i = 0;
//
// while (i < arr.length) {
//     if (arr[i] % 2 === 0) {
//     console.log(arr[i]);
//     }
//     i++;
// }

// // 1.6
// // Перебрати циклом for та вивести  числа тільки парні  значення.
//
// for (const num of arr) {
//     if (num % 2 === 0 )
//     console.log(num);
// }

// // 1.7
// // Замінити кожне число кратне 3 на слово "okten".
//
// let len = arr.length;
//
// for (let i = 0; i < len; i++) {
//     if (arr[i] % 3 === 0) {
//         arr.splice(i,1, 'okten');
//     }
// }
//
// console.log(arr);

// // 1.8
// // Вивести масив в зворотньому порядку.
//
// for (let i = arr.length - 1; i >= 0; i--) {
//     console.log(arr[i]);
// }

// 1.9 Всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед).

// // 1.9.1
//
// let i = arr.length - 1;
//
// while (i >= 0) {
//     console.log(arr[i]);
//     i--;
// }

// // 1.9.2
//
// for (let i = arr.length - 1; i >= 0; i--) {
//     console.log(arr[i]);
// }

// // 1.9.3
//
// let i = arr.length - 1;
//
// while (i >= 0) {
//     if (i % 2 > 0) {
//     console.log(arr[i]);
//     }
//     i--;
// }

// // 1.9.4
//
// for (let i = arr.length - 1; i >= 0; i--) {
//     if (i % 2 > 0 )
//     console.log(arr[i]);
// }

// // 1.9.5
//
// let i = arr.length - 1;
//
// while (i >= 0) {
//     if (arr[i] % 2 === 0) {
//     console.log(arr[i]);
//     }
//     i--;
// }

// // 1.9.6
//
// for (let i = arr.length - 1; i >= 0; i--) {
//     if (arr[i] % 2 === 0 )
//     console.log(arr[i]);
// }

// // 1.9.7
//
// for (let i = arr.length - 1; i >= 0; i--) {
//     if (arr[i] % 3 === 0) {
//         arr.splice(i,1, 'okten');
//     }
//     console.log(arr[i]);
// }
//
// console.log(arr);

// // 1.10.1
// // Створити пустий масив та :
// // Заповнити його 50 парними числами за допомоги циклу.
//
// let nums = [];
// let num = 1;
//
// while (nums.length < 50) {
//     if (num % 2 === 0) {
//         nums.push(num);
//     }
//     num++;
// }
//
// console.log(nums);

// // 1.10.2
// // Створити пустий масив та :
// // Заповнити його 50 непарними числами за допомоги циклу.
//
// let nums = [];
// let num = 1;
//
// while (nums.length < 50) {
//     if (num % 2 > 0) {
//         nums.push(num);
//     }
//     num++;
// }
//
// console.log(nums);

// // 2
// // Створити пустий масив та :
//
// // 2.1
// // Заповнити його 50 парними числами за допомоги циклу.
//
// let nums = [];
// let num = 1;
//
// while (nums.length < 50) {
//     if (num % 2 === 0) {
//         nums.push(num);
//     }
//     num += 3;
// }
//
// // 2.2
// // Заповнити його 50 непарними числами за допомоги циклу.
//
// let nums2 = [];
// let num2 = 1;
//
// while (nums2.length < 50) {
//     if (num2 % 2 > 0) {
//         nums2.push(num2);
//     }
//     num2 += 4;
// }
//
// // 2.3
// // Используя Math.random заполнить массив из ???(сколько хотите) элементов.
// // Диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
//
// let nums3 = [];
//
// while (nums3.length < 10) {
//     nums3.push(Math.random() * (732 - 8) + 8);
// }

// // 3
// // Вывести на консоль  каждый третий елемент.
//
// let nums = [1,2,3,5,7,9,56,8,67];
//
// for (let i = 0; i < nums.length; i += 3) {
//     console.log(nums[i]);
// }

// // 4
// // Вывести на консоль  каждый третий елемент,
// // но при условии что его значение является парным.
//
// let nums = [1,2,3,5,7,9,56,8,67];
//
// for (let i = 0; i < nums.length; i += 3) {
//     if (nums[i] % 2 === 0) {
//         console.log(nums[i]);
//     }
// }

// // 5
// // Вывести на консоль  каждый третий елемент,
// // но при условии что он имеет парное значение и
// // записать их в другой массив.
//
// let nums = [1,2,3,5,7,9,56,8,67];
// let nums1 = [];
//
// for (let i = 0; i < nums.length; i += 3) {
//     if (nums[i] % 2 === 0) {
//         console.log(nums[i]);
//         nums1.push(nums[i]);
//     }
// }
//
// console.log(nums1);

// // 6
// // Вывести каждый елемент массива у которого соседний с права элемент - парный.
//
// let nums = [1,2,3,5,7,9,56,8,67];
// let num = 0;
//
// for (let i = 0; i < nums.length; i++) {
//     if (nums[i] % 2 === 0) {
//         console.log(num);
//     }
//     num = nums[i];
// }

// // 7
// // Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
// let costs = [100,250,50,168,120,345,188];
// let totalCost = 0;
// let averageCost;
//
// for (const cost of costs) {
//     totalCost += cost;
// }
//
// averageCost = totalCost / costs.length;
//
// console.log('Загальна вартість: ' + totalCost);
// console.log('Середня вартість: ' + averageCost);

// // 8
// // Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//
// let nums = [1,2,3,5,7,9,56,8,67];
// let numsX5 = [];
//
// for (const num of nums) {
//     numsX5.push(num*5);
// }
//
// console.log(nums);
// console.log(numsX5);

// // 9
// // Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому,
// // і якщо елемент є числом - додати його в інший масив.
//
// let arr = [3,'thus',true,7,4,false,'shk','ten','okt',4,'aloha',86,false,0];
// let nums = [];
//
// for (const elem of arr) {
//     if (typeof elem === 'number') {
//         nums.push(elem);
//     }
// }
//
// console.log(nums);